example/openTerrain/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setUp"

numberOfSubdomains $nCores;

//Decomposition used for actual simulation.
method          scotch;

//Decomposition used for snappyHexMesh
//method          hierarchical;

hierarchicalCoeffs
{
    n           (4 8 2);
    delta       0.001;
    order       xyz;
}
// ************************************************************************* //
