example/openTerrain/system/probes2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval   1;

fields
(
    U
);

probeLocations
(
(2.500000 0.000000 0.025000)
(2.500000 0.000000 0.075510)
(2.500000 0.000000 0.126020)
(2.500000 0.000000 0.176531)
(2.500000 0.000000 0.227041)
(2.500000 0.000000 0.277551)
(2.500000 0.000000 0.328061)
(2.500000 0.000000 0.378571)
(2.500000 0.000000 0.429082)
(2.500000 0.000000 0.479592)
(2.500000 0.000000 0.530102)
(2.500000 0.000000 0.580612)
(2.500000 0.000000 0.631122)
(2.500000 0.000000 0.681633)
(2.500000 0.000000 0.732143)
(2.500000 0.000000 0.782653)
(2.500000 0.000000 0.833163)
(2.500000 0.000000 0.883673)
(2.500000 0.000000 0.934184)
(2.500000 0.000000 0.984694)
(2.500000 0.000000 1.035204)
(2.500000 0.000000 1.085714)
(2.500000 0.000000 1.136224)
(2.500000 0.000000 1.186735)
(2.500000 0.000000 1.237245)
(2.500000 0.000000 1.287755)
(2.500000 0.000000 1.338265)
(2.500000 0.000000 1.388776)
(2.500000 0.000000 1.439286)
(2.500000 0.000000 1.489796)
(2.500000 0.000000 1.540306)
(2.500000 0.000000 1.590816)
(2.500000 0.000000 1.641327)
(2.500000 0.000000 1.691837)
(2.500000 0.000000 1.742347)
(2.500000 0.000000 1.792857)
(2.500000 0.000000 1.843367)
(2.500000 0.000000 1.893878)
(2.500000 0.000000 1.944388)
(2.500000 0.000000 1.994898)
(2.500000 0.000000 2.045408)
(2.500000 0.000000 2.095918)
(2.500000 0.000000 2.146429)
(2.500000 0.000000 2.196939)
(2.500000 0.000000 2.247449)
(2.500000 0.000000 2.297959)
(2.500000 0.000000 2.348469)
(2.500000 0.000000 2.398980)
(2.500000 0.000000 2.449490)
(2.500000 0.000000 2.500000)
);

// ************************************************************************* //
